Revit 2024 API
ControlledApplication.CurrentUsersAddinsDataFolderPath Property
 Path to AddinsData folder for the current user.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public string CurrentUsersAddinsDataFolderPath { get; }
Visual Basic
Public ReadOnly Property CurrentUsersAddinsDataFolderPath As String
	Get
Visual C++
public:
property String^ CurrentUsersAddinsDataFolderPath {
	String^ get ();
}
Remarks
 Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]\AddinsData
See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace